# <서로소 집합 자료구조>

# '트리 자료구조'를 이용하여 집합을 표현한다.
#     (1) union 연산을 확인하여, 서로 연결된 두 노드 A, B를 확인한다.
#         (i)  A와 B의 루트 노드 A', B'를 각각 찾는다.
#         (ii) A'를 B'의 부모 노드로 설정한다(B'가 A'를 가리키도록 한다.)
#     (2) 모든 union 연산을 처리할 때까지 (1)번 과정을 반복한다.

# 트리 구조상 번호가 작은 노드가 부모가 되고, 번호가 큰 노드가 자식이 된다.

# ---------------------------------------------------------------------------------------------------------------------
# <동작 과정> (p.270)
# 가장 먼저 노드의 개수(V) 크기의 부모 테이블을 초기화한다. 이때 모든 원소가 자기 자신을 부모로 가지도록 한다.
# 유의할 점은 부모 테이블은 부모에 대한 정보만을 담고 있다는 것이다. 즉 특정 노드의 부모에 대해서만 저장한다.
# 그다음 union 연산을 차례대로 확인하며 각각의 노드의 루트 노드를 찾으며 부모 노드를 설정한다.

# 이 알고리즘에서 유의할 점은 우리는 union 연산을 효과적으로 수행하기 위해 '부모 테이블'을 항상 가지고 있어야 한다는 것이다.
# 또한 루트 노드를 즉시 계산할 수 없고, 부모 테이블을 계속해서 확인하며 거슬러 올라가야 한다.
# 서로소 집합 알고리즘으로 루트 노드를 찾기 위해서는 재귀적으로 부모를 거슬러 올라가야 한다.

# ---------------------------------------------------------------------------------------------------------------------
# 기본적인 서로소 집합 알고리즘 소스코드

# 특정 원소가 속한 집합 찾기
def find_parent(parent, x):
    # 루트 노드가 아니라면, 루트 노드를 찾을 때까지 재귀적으로 호출
    if parent[x] != x:
        return find_parent(parent, parent[x])
    return x


# 두 원소가 속한 집합을 합치기
def union_parent(parent, a, b):
    a = find_parent(parent, a)
    b = find_parent(parent, b)
    if a < b:
        parent[b] = a
    else:
        parent[a] = b


# 노드의 개수와 간선(union 연산)의 개수 입력받기
v, e = map(int, input().split())
parent = [0] * (v + 1)

# 부모 테이블상에서, 부모를 자기 자신으로 초기화
for i in range(1, v + 1):
    parent[i] = i

# union 연산을 각각 수행
for i in range(e):
    a, b = map(int, input().split())
    union_parent(parent, a, b)

# 각 원소가 속한 집합 출력
print('각 원소가 속한 집합: ', end=' ')
for i in range(1, v + 1):
    print(find_parent(parent, i), end=' ')
print()

# 부모 테이블 내용 출력
print('부모 테이블: ', end=' ')
for i in range(1, v + 1):
    print(parent[i], end=' ')

# 입력 예시
# 6 4
# 1 4
# 2 3
# 2 4
# 5 6
# 출력 예시
# 각 원소가 속한 집합:  1 1 1 1 5 5     # 1부터 6까지의 각 원소의 루트 노드가 1, 1, 1, 1, 5, 5
# 부모 테이블:  1 1 2 1 5 5
