
# 다만, 이렇게 구현하면 답을 구할 수는 있지만, find 함수가 비효율적으로 동작한다.
# 최악의 경우 find 함수가 모든 노드를 다 확인하는 터라 시간 복잡도가 O(V)이다.
# 현재의 알고리즘을 그대로 이용하게 되면 노드의 개수가 V개이고 find 혹은 union 연산의 개수가 M개일 때,
# 전체 시간 복잡도는 O(VM)이 되어 비효율적이다

# 이러한 find 함수는 '경로 압축 기법'을 적용하면 시간 복잡도를 개선시킬 수 있다.
# 경로 압축은 find 함수를 재귀적으로 호출한 뒤에 부모 테이블값을 갱신하는 기법이다.
# 이렇게 함수를 수정하면 각 노드에 대해 find 함수를 호출한 이후에, 해당 노드의 루트 노드가 바로 부모 노드가 된다.
def find_parent(parent, x):
    if parent[x] != x:
        parent[x] = find_parent(parent, parent[x])
    return parent[x]