# 크루스칼 알고리즘

# 신장 트리 중에서 최소 비용으로 만들 수 있는 신장 트리를 찾는 알고리즘을 '최소 신장 트리 알고리즘'이라 한다.
# '크루스칼 알고리즘'은 최소 신장 트리 알고리즘의 대표적인 예이다. 또한 크루스칼 알고리즘은 그리디 알고리즘에 속한다.

# 먼저 모든 간선에 대하여 정렬을 수행한 뒤에 가장 거리가 짧은 간선부터 집합에 포함시키면 된다.
# 이때 사이클을 발생시킬 수 있는 간선의 경우, 집합에 포함시키지 않는다.
#     (1) 간선 데이터를 비용에 따라 오름차순으로 정렬한다.
#     (2) 간선을 하나씩 확인하며 현재의 간선이 사이클을 발생시키는지 확인한다.
#         (i)  사이클이 발생하지 않는 경우 최소 신장 트리에 포함시킨다.
#         (ii) 사이클이 발생하는 경우 최소 신장 트리에 포함시키지 않는다.
#     (3) 모든 간선에 대해 (2)번의 과정을 반복한다.

# 신장 트리에 포함되는 간선의 개수가 '노드의 개수 - 1'과 같다는 특징이 있다.
# 따라서 크루스칼 알고리즘의 핵심 원리는 가장 거리가 짧은 간선부터 차례대로 집합에 추가하면 된다는 것이다.
# 다만, 사이클을 발생시키는 간선은 제외하고 연결한다.

# ---------------------------------------------------------------------------------------------------------------------
# 크루스칼 알고리즘 소스코드

# 특정 원소가 속한 집합 찾기
def find_parent(parent, x):
    # 루트 노드가 아니라면, 루트 노드를 찾을 때까지 재귀적으로 호출
    if parent[x] != x:
        return find_parent(parent, parent[x])
    return parent[x]


# 두 원소가 속한 집합을 합치기
def union_parent(parent, a, b):
    a, b = find_parent(parent, a), find_parent(parent, b)
    if a < b:
        parent[b] = a
    else:
        parent[a] = b


# 노드의 개수와 간선(union 연산)의 개수 입력받기
v, e = map(int, input().split())
parent = [0] * (v + 1)

# 모든 간선을 담을 리스트와 최종 비용을 담을 변수
edges = []
result = 0

# 부모 테이블상에서, 부모를 자기 자신으로 초기화
for i in range(1, v + 1):
    parent[i] = i

# 모든 간선에 대한 정보 입력받기
for _ in range(e):
    a, b, cost = map(int, input().split())
    # 비용순으로 정렬하기 위해 튜플의 첫 번째 원소를 비용을 설정
    edges.append((cost, a, b))

# 간선을 비용순으로 정렬
edges.sort()

# 간선을 하나씩 확인하며
for edge in edges:
    cost, a, b = edge
    # 사이클이 발생하지 않는 경우에만 집합에 포함
    if find_parent(parent, a) != find_parent(parent, b):
        union_parent(parent, a, b)
        result += cost

print(result)

# 입력 예시
# 7 9
# 1 2 29
# 1 5 75
# 2 3 35
# 2 6 34
# 3 4 7
# 4 6 23
# 4 7 13
# 5 6 53
# 6 7 25
# 출력 예시
# 159

# 크루스칼 알고리즘의 시간 복잡도는 O(ElogE) (이때 E는 간선의 개수)
# 시간이 가장 오래 걸리는 부분이 간선을 정렬하는 작업인데, E개의 데이터를 정렬했을 때의 시간 복잡도는 O(ElogE)이기 때문이다.
