# 투 포인터
# 리스트에 순차적으로 접근해야 할 때 2개의 점의 위치를 기록하면서 처리하는 알고리즘.
# 리스트에 담긴 데이터에 순차적으로 접근해야 할 때는
# '시작점'과 '끝점' 2개의 점으로 접근할 데이터의 범위를 표현할 수 있다.
# 투 모인터 알고리즘의 특징은 2개의 변수를 이용하여 리스트 상의 위치를 기록한다는 점이다.

# '투 포인터 알고리즘'을 이용하여 '특정한 합을 가지는 부분 연속 수열 찾기' 문제를 풀어보자.
# 이 문제는 양의 정수로만 구성된 리스트가 주어졌을 때,
# 그 부분 연속 수열 중에서 '특정한 합'을 갖는 수열의 개수를 출력하는 문제이다.
# (단, 리스트 내 원소에 음수 데이터가 포함되어 있으면 투 포인터 알고리즘을 쓸 수 없다.)

# (1) 시작점과 끝점이 첫 번째 원소의 인덱스를 가리키도록 한다.
# (2) 현재 부분합이 M과 같다면 카운트한다.
# (3) 현재 부분합이 M보다 작으면 끝점의 위치를 1 증가시킨다.
# (4) 현재 부분합이 M보다 크거나 같으면 시작점의 위치를 1 증가시킨다.
# (5) 모든 경우를 확인할 때까지 (2)번부터 (4)번까지의 과정을 반복한다.

n = 5   # 데이터의 개수
m = 5   # 찾고자 하는 부분합
data = [1, 2, 3, 2, 5]

count = 0
interval_sum = 0
end = 0

# start를 차례대로 증가시키며 반복
for start in range(n):
    # end를 가능한 만큼 이동시키기
    while interval_sum < m and end < n:
        interval_sum += data[end]
        end += 1
    # 부분합이 m일 때 카운트 증가
    if interval_sum == m:
        count += 1
    interval_sum -= data[start]

print(count)

# 이 밖에도 투 포인터 알고리즘은 '정렬되어 있는 두 리스트의 합집합'같은 문제에도 활용된다.
# 이 문제에서는 이미 정렬되어 있는 2개의 리스트가 입력으로 주어진다.
# 이때 두 리스트의 모든 원소를 합쳐서 정렬한 결과를 계산하는 것이 문제의 요구사항이다.
# ('정렬되어 있는 리스트의 합집합' 알고리즘은 병합 정렬(Merge Sort)에도 사용된다.)

# 이 문제를 풀기 위해서는 2개의 리스트 A, B가 주어졌을 때,
# 2개의 포인터를 이용하여 각 리스트에서 처리되지 않은 원소 중 가장 작은 원소를 가리키면 된다.
# 결과적으로 정렬된 리스트 A와 B의 데이터 개수가 각각 N, M일 때,
# 이 알고리즘의 시간 복잡도는 O(N + M)이 된다.

# 사전에 정렬된 리스트 a와 b 선언
n, m = 3, 4
a = [1, 3, 5]
b = [2, 4, 6, 8]

# 리스트 a와 b의 모든 원소를 담을 수 있는 크기의 결과 리스트 초기화
result = [0] * (n + m)
i = j = k = 0

# 모든 원소가 결과 리스트에 담길 때까지 반복
while i < n or j < m:
    # 리스트 b의 모든 원소가 처리되었거나, 리스트 a의 원소가 더 작을 때
    if j >= m or (i < n and a[i] <= b[j]):
        # 리스트 a의 원소를 결과 리스트로 옮기기
        result[k] = a[i]
        i += 1
    # 리스트 a의 모든 원소가 처리되었거나, 리스트 b의 원소가 더 작을 때
    else:
        result[k] = b[j]
        j += 1
    k += 1

for i in result:
    print(i, end=' ')
