# 개미 전사 (p.220)

# 이 문제의 점화식은 어떻게 세울까?
# 왼쪽부터 차례대로 식량창고를 턴다고 가정하면 어렵지 않게 점화식을 세울 수 있다.
# 왼쪽부터 차례대로 식량창고를 털지 안 털지를 결정하는 경우와 특정한 i번째 식량창고에 대해서 털지 안 털지의 여부를 결정할 때,
# 단 2가지의 경우에 대해서만 확인하면 된다.
#     1. (i - 1)번째 식량창고를 털기로 결정한 경우 현재의 식량창고를 털 수 없다.
#     2. (i - 2)번째 식량창고를 털기로 결정한 경우 현재의 식량창고를 털 수 있다.
# 따라서 위의 2가지의 경우 중에서 더 많은 식량을 털 수 있는 경우를 선택하면 된다.

# 여기서 알아둘 점은 왼쪽부터 (i - 3)번째 이하의 식량 창고에 대해서는 고려할 필요가 없다.
# 한 칸 이상 떨어진 식량창고는 항상 털 수 있기 때문이다.
# 따라서 i번째 식량창고에 있는 식량의 양이 k(i)라고 했을 때 점화식은 다음과 같다.
#     a(i) = max( a(i-1), a(i-2) + k(i) )

# --------------------------------------------------------------------------------------------------------------------
# 정수 N 입력받기
n = int(input())
# 모든 식량 정보 입력받기
array = list(map(int, input().split()))

# 앞서 계산된 결과를 저장하기 위한 DP 케이블 초기화
d = [0] * 100

# 다이나믹 프로그래밍(Dynamic Programming) 진행(보텀업)
d[0] = array[0]
d[1] = max(array[0], array[1])
for i in range(2, n):
    d[i] = max(d[i - 1], d[i - 2] + array[i])

print(d[:n])
print(d[n - 1])