# 효율적인 화폐 구성

# 그리디에서 다루었던 거스름돈 문제와 거의 비슷하지만, 화폐 단위에서 큰 단위가 작은 단위의 배수가 아니라는 점이 가장 큰 차이점이다.
# 따라서 그리디 알고리즘을 사용했던 에시처럼 매번 가장 큰 화폐 단위부터 처리하는 방법으로는 해결할 수 없고 다이나믹 프로그래밍을 써야 한다.

# 이번 문제는 적은 금액부터 큰 금액까지 확인하며 차례대로 만들수 있는 최소한의 화폐 개수를 찾으면 된다.
# 금액 i를 만들 수 있는 최소한의 화폐 개수를 a(i), 화폐의 단위를 k라고 했을 때 다음과 같은 점화식을 작성할 수 있다.
# a(i-k)는 금액 (i - k)를 만들 수 잇는 최소한의 화폐 개수를 의미한다.
#     a(i - k)를 만드는 방법이 존재하는 경우, a(i) = min( a(i), a(i - k) + 1 )
#     a(i - k)를 만드는 방법이 존재하지 않는 경우, a(i) = 10001

# ---------------------------------------------------------------------------------------------------------------------
# 정수 N, M 입력받기
n, m = map(int, input().split())
# N개의 화폐 단위 정보 입력받기
array = []
for i in range(n):
    array.append(int(input()))

# 한 번 계산된 결과를 저장하기 위한 DP 테이블 초기화
d = [10001] * (m + 1)

# 다이나믹 프로그래밍(Dynamic Programming) 진행(보텀업)
d[0] = 0
for i in range(n):
    for j in range(array[i], m + 1):
        if d[j - array[i]] != 10001:    # (i - k)원을 만드는 방법이 존재하는 경우(이 코드는 필요는 없지만 이해를 도와줌)
            d[j] = min(d[j], d[j - array[i]] + 1)

if d[m] != 10001:
    print(d[m])
else:
    print(-1)