# 왕실의 나이트
# 체스판과 같은 8 x 8 좌표 평면의 정원의 특정한 한 칸에 나이트가 서 있다. 나이트는 이동을 할 때는 L자 형태로만
# 이동할 수 있으며 정원 밖으로는 나갈 수 없다. 나이트는 특정한 위치에서 다음과 같은 2가지 경우로 이동할 수 있다.
#     1. 수평으로 두 칸 이동한 뒤에 수직으로 한 칸 이동하기
#     2. 수직으로 두 칸 이동한 뒤에 수평으로 한 칸 이동하기
# 8 x 8 좌표 평면상에서 나이트의 위치가 주어졌을 때 나이트가 이동할 수 있는 경우의 수를 출력하는 프로그램을 작성하시오.
# 이때 왕실의 정원에서 행 위치를 표현할 때는 1부터 8로, 열 위치를 표현할 때는 a부터 h로 표현한다.

# 입력 조건
# - 첫째 줄에 8 X 8 좌표 평면상에서 현재 나이트가 위치한 곳의 좌표를 나타내는 두 문자로 구성된 문자열이 입력된다.
# - 입력 문자는 a1처럼 열과 행으로 이뤄진다.
# 출력 조건
# - 첫째 줄에 나이트가 이동할 수 있는 경우의 수를 출력하시오

# 입력 예시
# a1
# 출력 예시
# 2

# -----------------------------------------------------------------------------------------------
data = input()
row = int(data[1])
col = int(ord(data[0])) - int(ord('a')) + 1

# 나이트가 이동할 수 있는 8가지 방향 정의
steps = [(-2, -1), (-2, 1), (2, -1), (2, 1), (-1, -2), (-1, 2), (1, -2), (1, 2)]

count = 0
for step in steps:
    next_row = row + step[0]
    next_col = col + step[1]
    if next_row < 1 or next_row > 8 or next_col < 1 or next_col > 8:
        continue
    count += 1

print(count)

# -----------------------------------------------------------------------------------------------
# 왕실의 나이트 문제는 앞서 다루었던 예제 4-1 '상하좌우' 문제와 유사하다.
# 조금 더 까다롭게 문제를 출제한다면 입력 문자가 열과 행이 아닌 1a와 같은 행과 열 형태로 들어왔을 때의 예외 처리를 요구할 수도 있다.
