# 게임 개발
# 게임 캐릭터가 맵 안에서 움직이는 시스템을 개발 중이다. 캐릭터가 있는 장소는 1 X 1 크기의 정사각형으로 이뤄진 N X M 크기의 직사각형으로,
# 각각의 칸은 육지 또는 바다이다. 캐릭터는 동서남북 중 한 곳을 바라본다. 맵의 각 칸은 (A, B)로 나타낼 수 있고, A는 북쪽으로부터 떨어진
# 칸의 개수, B는 서쪽으로부터 멀어진 칸의 개수이다. 캐릭터는 상하좌우로 움직일 수 있고, 바다로 되어 있는 공간에는 갈 수 없다.
#     1. 현재 위치에서 현재 방향을 기준으로 왼쪽 방향부터 차례대로 갈 곳을 정한다.
#     2. 캐릭터의 바로 왼쪽 방향에 아직 가보지 않은 칸이 존재한다면, 왼쪽 방향으로 회전한 다음 왼쪽으로 한 칸을 전진한다.
#        왼쪽 방향에 가보지 않은 칸이 없다면, 왼쪽 방향으로 회전만 수행하고 1단계로 돌아간다.
#     3. 만약 네 방향 모두 이미 가본 칸이거나 바다로 되어 있는 칸인 경우에는, 바라보는 방향을 유지한 채로 한 칸 뒤로 가고
#        1단계로 돌아간다. 단, 이때 뒤쪽 방향이 바다인 칸이라 뒤로 갈 수 없는 경우에는 움직임을 멈춘다.
# 위 과정을 반복적으로 수행하면서 캐릭터의 움직임에 이상이 있는지 테스트하려 한다. 매뉴얼에 따라 캐릭터를 이동시킨 뒤에,
# 캐릭터가 방문한 칸의 수를 출력하는 프로그램을 만드시오.

# 입력 조건
# - 첫째 줄에 맵의 세로 크기 N과 가로 크기 M을 공백으로 구분하여 입력한다.(3 <= N, M <= 50)
# - 둘째 줄에 게임 캐릭터가 있는 칸의 좌표 (A, B)와 바라보는 방향 d가 각각 서로 공백으로 구분하여 주어진다.
#   방향 d의 값으로는 0: 북쪽, 1: 동쪽, 2: 남쪽, 3: 서쪽 이렇게 4가지가 존재한다.
# - 셋째 줄부터 맵이 육지인지 바다인지에 대한 정보가 주어진다. N개의 줄에 맵의 상태가 북쪽부터 남쪽 순서대로,
#   각 줄의 데이터는 서쪽부터 동쪽 순서대로 주어진다. 맵의 외곽은 항상 바다로 되어 있다. (0: 육지, 1: 바다)
# - 처음에 게임 캐릭터가 위치한 칸의 상태는 항상 육지이다.
# 출력 조건
# - 첫째 줄이 이동을 마친 후 캐릭터가 방문한 칸의 수를 출력한다.

# 입력 예시
# 4 4       # 4 X 4 맵
# 1 1 0     # (1, 1)에 북쪽(0)을 바라보고 서 있는 캐릭터
# 1 1 1 1
# 1 0 0 1
# 1 1 0 1
# 1 1 1 1
# 출력 예시
# 3

# -----------------------------------------------------------------------------------------------
n, m = map(int, input().split())
a, b, direction = map(int, input().split())

# 게임 맵 초기화
game_map = []
for i in range(n):
    game_map.append(list(map(int, input().split())))

# 캐릭터가 방문한 위치를 저장하는 리스트
user_visit = [[0] * m for _ in range(n)]
user_visit[a][b] = 1  # 현재 위치 방문 처리

# 0: 북쪽, 1: 동쪽, 2: 남쪽, 3: 서쪽
da = [-1, 0, 1, 0]
db = [0, 1, 0, -1]


# 왼쪽으로 회전
def turn_left():
    global direction
    direction -= 1
    if direction < 0:
        direction = 3


count = 1   # 현재 위치 방문 처리
turn_left_count = 0
while True:
    # 1. 현재 위치에서 현재 방향을 기준으로 왼쪽 방향부터 차례대로 갈 곳을 정한다.
    turn_left()
    next_a = a + da[direction]
    next_b = b + db[direction]
    # 2. 캐릭터의 바로 왼쪽 방향에 아직 가보지 않은 칸이 존재한다면, 왼쪽 방향으로 회전한 다음 왼쪽으로 한 칸을 전진한다.
    #    왼쪽 방향에 가보지 않은 칸이 없다면, 왼쪽 방향으로 회전만 수행하고 1단계로 돌아간다.
    if game_map[next_a][next_b] == 0 and user_visit[next_a][next_b] == 0:
        a = next_a
        b = next_b
        user_visit[a][b] = 1    # 해당 위치를 방문했다는 사실을 기록
        count += 1              # 움직인 횟수 +1
        turn_left_count = 0     # 왼쪽으로의 회전 수 초기화
        continue
    else:
        turn_left_count += 1
    # 3. 네 방향 모두 이미 가본 칸이거나 바다로 되어 있는 칸인 경우에는, 바라보는 방향을 유지한 채로 한 칸 뒤로 후진한다.
    #    단, 뒤쪽 방향이 바다인 칸이라 뒤로 갈 수 없는 경우에는 움직임을 멈춘다
    if turn_left_count == 4:
        next_a = a - da[direction]  # 전진과는 반대로 후진은 '-'
        next_b = b - db[direction]
        if game_map[next_a][next_b] != 0:
            a = next_a
            b = next_b
        else:
            break
        turn_left_count = 0

print(count)

# -----------------------------------------------------------------------------------------------
# 전형적인 시뮬레이션 문제. 별도의 알고리즘이 필요하기보다는 문제에서 요구하는 내용을 오류 없이 구현만 하면 풀 수 있는 문제.
# 일반적으로 '방향'을 설정해어 이동하는 문제 유형에서는 dx, dy라는 별도의 리스트를 만들어 방향을 정하는 것이 효과적이다.
# 그리고 파이썬에서는 2차원 리스트를 선언할 때 '리스트 컴프리헨션'을 이용하는 것이 효율적이라는 점을 기억하자.
